




Switch>
Switch>
Switch>en
Switch#ena
Switch#enable ?
  <0-15>  Enable level
  <cr>
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#enable
Switch(config)#enable ?
  password  Assign the privileged level password
  secret    Assign the privileged level secret
Switch(config)#enable pass
Switch(config)#enable password cisco
Switch(config)#enable sec
Switch(config)#enable secret ccna
Switch(config)#line ?
  <0-16>   First Line number
  console  Primary terminal line
  vty      Virtual terminal
Switch(config)#line ?
  <0-16>   First Line number
  console  Primary terminal line
  vty      Virtual terminal
Switch(config)#line con
Switch(config)#line console ?
  <0-0>  First Line number
Switch(config)#line console 0
Switch(config-line)#pass
Switch(config-line)#password cisco
Switch(config-line)#login
Switch(config-line)#exit
Switch(config)#line vt
Switch(config)#line vty ?
  <0-15>  First Line number
Switch(config)#line vty 0 4

Switch(config-line)#password ccna
Switch(config-line)#password ccna
Switch(config-line)#login
Switch(config-line)#exit
Switch(config)#do wr
Building configuration...
[OK]
Switch(config)#
Switch(config)#ser
Switch(config)#service pass
Switch(config)#service password-encryption 
Switch(config)#
Switch(config)#^Z
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#copy ru
Switch#copy running-config sta
Switch#copy running-config startup-config 
Destination filename [startup-config]? 
Building configuration...
[OK]
Switch#
Switch#
Switch#



Router>
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#enable password cisco
Router(config)#enable secret ccna
Router(config)#hostname nam
Router(config)#hostname HQ_R

HQ_R(config)#line aux 0
HQ_R(config-line)#pass
HQ_R(config-line)#password CISCO
HQ_R(config-line)#pass
HQ_R(config-line)#password cisco
HQ_R(config-line)#login
HQ_R(config-line)#exit

HQ_R(config)#line console 0
HQ_R(config-line)#password cisco
HQ_R(config-line)#login
HQ_R(config-line)#exit
HQ_R(config)#lin
HQ_R(config)#line vt
HQ_R(config)#line vty 0 4
HQ_R(config-line)#pas
HQ_R(config-line)#password ccna
HQ_R(config-line)#login
HQ_R(config-line)#exit
HQ_R(config)#
HQ_R(config)#service pa
HQ_R(config)#service password-encryption 
HQ_R(config)#
HQ_R(config)#do wr
Building configuration...
[OK]
HQ_R(config)